## 판다스?

테이터프레임(엑셀과 비슷) 과 시리즈라는 자료형  
데이터 분석을 위한 다양한 기능을 제공하는 라이브러리  
R의 데이터프레임에 영향  
내부적으로 numpy 를 사용하므로 함께 import  

http://pandas.pydata.org

기능요약  
https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

# Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
x = [1, 2, 3, 4, 5]
pd.Series(x)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
x = np.array([1, 2, 3, 4, 5])
pd.Series(x) #Series는 index와 value값으로 구분

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [ ]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x)

print(x[0])
print(x[1: 3])
print(x[::-1]) #뒤집는거
print(x[x > 3]) #불리언인덱싱
print(x + 1) 
print(x * 10)
print(x + x)

# Series Index

In [4]:
import pandas as pd
import numpy as np

x = [1, 2, 3, 4, 5]
x = pd.Series(x)
print(x.index)
print(x.values)

RangeIndex(start=0, stop=5, step=1)
[1 2 3 4 5]

In [5]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x, index=['a','b','c','d','e']) #인덱스설정
print(x)

print(x['a']) #명시적 인덱스접근
print(x[0]) #묵시적 인덱스접근
print(x[['a','e']]) #팬시색인, 한번에 여러값 접근
print(x.a)

a    1
b    2
c    3
d    4
e    5
dtype: int64
1
1
a    1
e    5
dtype: int64
1

In [6]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x, index=[1, 2, 3, 4, 5])

# x[0] 오류
print(x.iloc[0]) #묵시적 인덱스로만
print(x.loc[1]) #명시적 인덱스로만

1
1

## 딕셔너리 to Series

In [7]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
x = pd.Series(x)

x

수학    90
영어    80
과학    95
미술    80
dtype: int64

In [ ]:
print(x['수학'])

In [ ]:
print(x['영어':])

In [8]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
x = pd.Series(x, index=["수학", "영어", "과학"])
x

수학    90
영어    80
과학    95
dtype: int64

## Multi Index

In [9]:
student_1 = {"수학":90, "영어":80, "과학":95, "미술":80}
student_2 = {"수학":70, "영어":90, "과학":100, "미술":70}

In [5]:

#index_1 = ['홍길동','홍길동','홍길동','홍길동','이몽룡','이몽룡','이몽룡','이몽룡']
index_1 = ['홍길동' for i in range(len(student_1))] + ['이몽룡' for i in range(len(student_2))]
print(index_1)

['홍길동', '홍길동', '홍길동', '홍길동', '이몽룡', '이몽룡', '이몽룡', '이몽룡']

In [7]:

#index_2 = ['수학','영어','과학','미술','수학','영어','과학','미술']
index_2 = [i for i in student_1] + [i for i in student_2]
print(index_2)

['수학', '영어', '과학', '미술', '수학', '영어', '과학', '미술']

In [16]:

value_all = list(student_1.values()) + list(student_2.values())
print(value_all)

[90, 80, 95, 80, 70, 90, 100, 70]

AttributeError: 'dict' object has no attribute 'vlaues'

In [18]:
import pandas as pd
students = pd.Series(value_all, index=[index_1, index_2])
students

홍길동  수학     90
     영어     80
     과학     95
     미술     80
이몽룡  수학     70
     영어     90
     과학    100
     미술     70
dtype: int64

In [ ]:
students['홍길동']

In [ ]:
students['이몽룡']

## 결측값 처리방법 (NaN. None)

In [19]:
x = [1, None, 2, None, 3, 4, None]
x = pd.Series(x)
print(x)

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
5    4.0
6    NaN
dtype: float64

In [ ]:

print(x.sum())
print(x.max())
print(x.min())

#결측값 개수
print(x.isnull().sum())
print(x.notnull().sum())

#결측값 제거
print(x.dropna())

#결측값을 다른값으로 채우기
x.fillna(0)

## concat

In [20]:
x = pd.Series([1, 2, 3])
y = pd.Series([4, 5, 6])
z = pd.Series([7, 8, 9])

pd.concat([x, y, z]) #인덱스 그대로임

0    1
1    2
2    3
0    4
1    5
2    6
0    7
1    8
2    9
dtype: int64

In [ ]:
pd.concat([x, y, z], verify_integrity=True) #같은 값의 인덱스가 있을경우 오류

In [ ]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True)

In [21]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True, axis=1) #데이터프레임(2차원)

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [22]:
x = pd.Series([1, 2, 3, 4])
y = pd.Series([4, 5, 6])
z = pd.Series([7, 8, 9])

In [ ]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True, axis=1, join='inner')

In [ ]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True, axis=1, join='outer')

## 연산과 집계함수

In [23]:
x = pd.Series([1, 2, 3, 4, 5])
y = pd.Series([6, 7, 8, 9, 0])

In [24]:

#더하기
print(x.add(10)) #각각에 10 더해짐
print(x.add(y)) #행렬합

0    11
1    12
2    13
3    14
4    15
dtype: int64
0     7
1     9
2    11
3    13
4     5
dtype: int64

In [25]:

#빼기
print(x.sub(y))

0   -5
1   -5
2   -5
3   -5
4    5
dtype: int64

In [27]:

#곱하기
print(x.mul(y))

#나누기
print(x.floordiv(2)) #몫
print(x.div(2))
print(x.mod(2))

#제곱
print(x.pow(2))

0     6
1    14
2    24
3    36
4     0
dtype: int64
0    0
1    1
2    1
3    2
4    2
dtype: int64
0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
dtype: float64
0    1
1    0
2    1
3    0
4    1
dtype: int64
0     1
1     4
2     9
3    16
4    25
dtype: int64

In [28]:

#기초통계
print(x.count())
print(x.min())
print(x.max())
print(x.mean())
print(x.median()) #중간값
print(x.sum())
print(x.std()) # 표준편차
print(x.var()) # 분산
print(x.mad()) # 절대표준편차
print(x.describe()) #기초통계모두

print(x.head(2)) #앞의 일부데이터 확인
print(x.tail(2)) #뒤의 일부데이터 확인

5
1
5
3.0
3.0
15
1.5811388300841898
2.5
1.2
count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64
0    1
1    2
dtype: int64
3    4
4    5
dtype: int64

## 실습1

In [17]:
from audioop import avg


x = [np.nan,1,2,3,4,5]
y = pd.Series([x[np.random.randint(0,6)] for i in range(20)])
print(y)
y.isnull().sum()
a = y.dropna()
b = y.fillna(y.mean())

print(b)

0     5.0
1     4.0
2     2.0
3     NaN
4     1.0
5     NaN
6     4.0
7     1.0
8     5.0
9     4.0
10    1.0
11    5.0
12    2.0
13    NaN
14    1.0
15    3.0
16    4.0
17    1.0
18    4.0
19    3.0
dtype: float64
0     5.000000
1     4.000000
2     2.000000
3     2.941176
4     1.000000
5     2.941176
6     4.000000
7     1.000000
8     5.000000
9     4.000000
10    1.000000
11    5.000000
12    2.000000
13    2.941176
14    1.000000
15    3.000000
16    4.000000
17    1.000000
18    4.000000
19    3.000000
dtype: float64

# DataFrame

In [29]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [30]:
sales_data['판매량']

0    103
1     70
2    130
3    160
4    190
5    230
Name: 판매량, dtype: int64

In [32]:
sales_data.iloc[2] #묵시적 접근

연도       2017
판매량       130
매출     400000
순이익    300000
Name: 2, dtype: int64

In [33]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

pd.DataFrame(sales_data, columns=['판매량','매출','순이익'], index=sales_data['연도'])

      판매량      매출     순이익
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018  160  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [ ]:
print(temp_df.loc[2017]) #명시적 인덱스 접근
print(temp_df.iloc[2]) #묵시적 인덱스 접근

## 파일생성

In [ ]:
%%writefile sales_data.csv
연도,판매량,매출,순이익
2015,103,500000,370000
2016,70,300000,190000
2017,130,400000,300000
2018,60,550000,480000
2019,190,700000,600000
2020,230,680000,590000

## CSV 파일읽기

In [38]:
sales_data = pd.read_csv('sales_data.csv', index_col='연도', header=0, sep=',')
sales_data

      판매량      매출     순이익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

## CSV 파일쓰기

In [39]:
sales_data.to_csv('sales_data_save.csv', encoding='utf-8-sig')

In [41]:
pd.read_csv('sales_data_save.csv',header=0, index_col='연도')

      판매량      매출     순이익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

## 데이터 추가

In [43]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [44]:
sales_data['순이익율'] = (sales_data['순이익']/sales_data['매출']) * 100
sales_data

     연도  판매량      매출     순이익       순이익율
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [45]:
def check(n):
    if n > 80:
        return '높음'
    else:
        return '낮음'

sales_data['순이익율_비교'] = sales_data['순이익율'].apply(check)
#조건표현식: True_Value if 조건 else 
#sales_data['순이익율_비교'] = sales_data['순이익율'].apply(lambda n: '높음' if n > 80 else '낮음')
sales_data

     연도  판매량      매출     순이익       순이익율 순이익율_비교
0  2015  103  500000  370000  74.000000      낮음
1  2016   70  300000  190000  63.333333      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

## 데이터 추가 2

In [42]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [50]:
sales_data[sales_data['매출'] > 300000]
sales_data['판매량']

0    103
1     70
2    130
3    160
4    190
5    230
Name: 판매량, dtype: int64

In [52]:
import numpy as np
sales_data['판매량'].apply(lambda x: 0 if x>200 else x)

0    103
1     70
2    130
3    160
4    190
5      0
Name: 판매량, dtype: int64

In [53]:
sales_data['테스트1'] = np.where(sales_data['판매량'] > 200, 0, sales_data['판매량'])
sales_data

     연도  판매량      매출     순이익       순이익율 순이익율_비교  테스트1
0  2015  103  500000  370000  74.000000      낮음   103
1  2016   70  300000  190000  63.333333      낮음    70
2  2017  130  400000  300000  75.000000      낮음   130
3  2018  160  550000  480000  87.272727      높음   160
4  2019  190  700000  600000  85.714286      높음   190
5  2020  230  680000  590000  86.764706      높음     0

In [54]:
sales_data['테스트2'] = sales_data[sales_data['판매량'] < 100]['판매량'] + 50
sales_data

     연도  판매량      매출     순이익       순이익율 순이익율_비교  테스트1   테스트2
0  2015  103  500000  370000  74.000000      낮음   103    NaN
1  2016   70  300000  190000  63.333333      낮음    70  120.0
2  2017  130  400000  300000  75.000000      낮음   130    NaN
3  2018  160  550000  480000  87.272727      높음   160    NaN
4  2019  190  700000  600000  85.714286      높음   190    NaN
5  2020  230  680000  590000  86.764706      높음     0    NaN

In [58]:
sales_data.loc[6] = [2021, 720000,650000, 360, 0, 0]
sales_data

ValueError: cannot set a row with mismatched columns

In [59]:
sales_data.loc[7] = sales_data.loc[5] + 100
sales_data

TypeError: can only concatenate str (not "int") to str

## 데이터 삭제

In [60]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data['테스트1'] = 'test1'
sales_data['테스트2'] = 'test2'
sales_data['테스트3'] = 'test3'

sales_data

     연도  판매량      매출     순이익   테스트1   테스트2   테스트3
0  2015  103  500000  370000  test1  test2  test3
1  2016   70  300000  190000  test1  test2  test3
2  2017  130  400000  300000  test1  test2  test3
3  2018  160  550000  480000  test1  test2  test3
4  2019  190  700000  600000  test1  test2  test3
5  2020  230  680000  590000  test1  test2  test3

In [61]:
del sales_data['테스트1']
sales_data

     연도  판매량      매출     순이익   테스트2   테스트3
0  2015  103  500000  370000  test2  test3
1  2016   70  300000  190000  test2  test3
2  2017  130  400000  300000  test2  test3
3  2018  160  550000  480000  test2  test3
4  2019  190  700000  600000  test2  test3
5  2020  230  680000  590000  test2  test3

In [62]:
sales_data.drop(['테스트2'], axis='columns', inplace=True)
sales_data

     연도  판매량      매출     순이익   테스트3
0  2015  103  500000  370000  test3
1  2016   70  300000  190000  test3
2  2017  130  400000  300000  test3
3  2018  160  550000  480000  test3
4  2019  190  700000  600000  test3
5  2020  230  680000  590000  test3

In [ ]:
sales_data.drop(['테스트3'], axis='columns', inplace=True)
sales_data

In [64]:
sales_data.columns[[0,2]]
sales_data.columns

Index(['연도', '판매량', '매출', '순이익', '테스트3'], dtype='object')

In [65]:
sales_data.drop(sales_data.columns[[0, 2]], axis='columns', inplace=True)
sales_data

   판매량     순이익   테스트3
0  103  370000  test3
1   70  190000  test3
2  130  300000  test3
3  160  480000  test3
4  190  600000  test3
5  230  590000  test3

In [66]:
sales_data.drop(0, inplace=True)
sales_data

   판매량     순이익   테스트3
1   70  190000  test3
2  130  300000  test3
3  160  480000  test3
4  190  600000  test3
5  230  590000  test3

In [67]:
sales_data.drop([3, 4, 5], inplace=True) #3,4,5행 삭제
sales_data

   판매량     순이익   테스트3
1   70  190000  test3
2  130  300000  test3

In [68]:
sales_data.reset_index(inplace=True)

In [71]:
sales_data.drop(['index'],axis='columns') #초기화된 인덱스
sales_data.drop(sales_data.columns[0], axis='columns',inplace=True) #인덱스까지 다 삭제

## Dataframe MultiIndex

In [73]:
df = pd.DataFrame(np.random.randint(1, 100, size=(4, 4)), index=[['A','A','B','B'],['a','b','a','b']], columns=[['가가','가가','나나','나나'],['가','나','가','나']])
df

     가가      나나
      가   나   가   나
A a   1  52  79  92
  b  25  11  97  56
B a  14  89  82  74
  b  29  34  51  82

In [74]:
df['가가']

      가   나
A a   1  52
  b  25  11
B a  14  89
  b  29  34

In [75]:
df.loc['A']

   가가      나나
    가   나   가   나
a   1  52  79  92
b  25  11  97  56

In [76]:
df.index

MultiIndex([('A', 'a'),
            ('A', 'b'),
            ('B', 'a'),
            ('B', 'b')],
           )

In [77]:
df.columns

MultiIndex([('가가', '가'),
            ('가가', '나'),
            ('나나', '가'),
            ('나나', '나')],
           )

## GroupBy

In [41]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)), index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],['사과','배','바나나','사과','사과','배','바나나','배']], columns=['판매','재고'])
df.index.names = ['창고명','상품명']
df

         판매  재고
창고명 상품명
A창고 사과   37  56
    배    91  50
    바나나  11  34
    사과   79  13
B창고 사과   84  18
    배    21  41
    바나나  63  68
    배    59   3

In [42]:
df.groupby('창고명').sum()

      판매   재고
창고명
A창고  218  153
B창고  227  130

In [ ]:
df.groupby('창고명').max()

In [ ]:
df.groupby('창고명').min()

In [40]:
df.groupby('상품명').sum()

NameError: name 'df' is not defined

In [ ]:
df.groupby(['창고명','상품명']).sum()

## sort_values

In [ ]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)), index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],['사과','배','바나나','사과','사과','배','바나나','배']], columns=['판매','재고'])
df

In [ ]:
df.sort_values(by="판매", ascending=True)

In [79]:
df.sort_values(by=["판매", "재고"], ascending=[True, False])

         판매  재고
창고명 상품명
A창고 배    13   7
B창고 배    18  68
    사과   25  15
A창고 사과   49  83
B창고 배    54  93
    바나나  68  40
A창고 바나나  71  26
    사과   73  48

## 실습2

In [43]:
from dataclasses import dataclass
import pandas as pd
class_dataframe = pd.DataFrame(np.random.randint(1,100, size=(15,3)), index=[['1학년','1학년','1학년','1학년','1학년','2학년','2학년','2학년','2학년','2학년','3학년','3학년','3학년','3학년','3학년'],['1반','2반','3반','4반','5반','1반','2반','3반','4반','5반','1반','2반','3반','4반','5반']], columns = ['국어','영어','과학'])
class_dataframe['총점'] = class_dataframe['국어'] + class_dataframe['영어'] + class_dataframe['과학']
class_dataframe['평균'] = class_dataframe['총점']/4
class_dataframe.index.names = ['학년','반']
x = class_dataframe.groupby('학년').sum()

x

      국어   영어   과학   총점      평균
학년
1학년  321  301  354  976  244.00
2학년  276  154  250  680  170.00
3학년  263  271  219  753  188.25

## 실습3

In [48]:
titanic_data = pd.read_csv('train.csv',index_col='PassengerId',header=0,sep=',')
titanic_data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [76]:
titanic_data['Age'].fillna(titanic_data['Age'].mean())
titanic_data['Cabin'].fillna('N')
titanic_data['Embarked'].fillna('N')

titanic_data.groupby('Sex').sum()
titanic_data.groupby('Pclass').sum()

age_range=pd.DataFrame(index=['유아','10대','20대','30대','40대','50대','60대','노인'],columns=['생존자 수'])

age_range.loc['유아']= titanic_data[titanic_data['Age']<10].sum()
age_range

C:\Users\gdevw\AppData\Local\Temp\ipykernel_14528\2586898305.py:10: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  age_range.loc['유아']= titanic_data[titanic_data['Age']<10].sum()

    생존자 수
유아    NaN
10대   NaN
20대   NaN
30대   NaN
40대   NaN
50대   NaN
60대   NaN
노인    NaN